STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215dxx_ca35.h
/************  Bit definition for CA35SSC_PLL_ENABLE_WS1 register  ************/
#define CA35SSC_PLL_ENABLE_WS1_PLL_EN_Pos                        (0U)
#define CA35SSC_PLL_ENABLE_WS1_PLL_EN_Msk                        (0x1UL << CA35SSC_PLL_ENABLE_WS1_PLL_EN_Pos)           /*!< 0x00000001 */
#define CA35SSC_PLL_ENABLE_WS1_PLL_EN                            CA35SSC_PLL_ENABLE_WS1_PLL_EN_Msk                     /*!<  */
#define CA35SSC_PLL_ENABLE_WS1_LOCKP_Pos                         (1U)
#define CA35SSC_PLL_ENABLE_WS1_LOCKP_Msk                         (0x1UL << CA35SSC_PLL_ENABLE_WS1_LOCKP_Pos)            /*!< 0x00000002 */
#define CA35SSC_PLL_ENABLE_WS1_LOCKP                             CA35SSC_PLL_ENABLE_WS1_LOCKP_Msk                      /*!<  */
#define CA35SSC_PLL_ENABLE_WS1_NRESET_SWPLL_Pos                  (2U)
#define CA35SSC_PLL_ENABLE_WS1_NRESET_SWPLL_Msk                  (0x1UL << CA35SSC_PLL_ENABLE_WS1_NRESET_SWPLL_Pos)     /*!< 0x00000004 */
#define CA35SSC_PLL_ENABLE_WS1_NRESET_SWPLL                      CA35SSC_PLL_ENABLE_WS1_NRESET_SWPLL_Msk               /*!<  */
#define CA35SSC_PLL_ENABLE_WS1_EN_PLL_OBS_Pos                    (31U)
#define CA35SSC_PLL_ENABLE_WS1_EN_PLL_OBS_Msk                    (0x1UL << CA35SSC_PLL_ENABLE_WS1_EN_PLL_OBS_Pos)       /*!< 0x80000000 */
#define CA35SSC_PLL_ENABLE_WS1_EN_PLL_OBS                        CA35SSC_PLL_ENABLE_WS1_EN_PLL_OBS_Msk                 /*!<  */

/************  Bit definition for CA35SSC_PLL_ENABLE_WC1 register  ************/
#define CA35SSC_PLL_ENABLE_WC1_PLL_EN_Pos                        (0U)
#define CA35SSC_PLL_ENABLE_WC1_PLL_EN_Msk                        (0x1UL << CA35SSC_PLL_ENABLE_WC1_PLL_EN_Pos)           /*!< 0x00000001 */
#define CA35SSC_PLL_ENABLE_WC1_PLL_EN                            CA35SSC_PLL_ENABLE_WC1_PLL_EN_Msk                     /*!<  */
#define CA35SSC_PLL_ENABLE_WC1_LOCKP_Pos                         (1U)
#define CA35SSC_PLL_ENABLE_WC1_LOCKP_Msk                         (0x1UL << CA35SSC_PLL_ENABLE_WC1_LOCKP_Pos)            /*!< 0x00000002 */
#define CA35SSC_PLL_ENABLE_WC1_LOCKP                             CA35SSC_PLL_ENABLE_WC1_LOCKP_Msk                      /*!<  */
#define CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL_Pos                  (2U)
#define CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL_Msk                  (0x1UL << CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL_Pos)     /*!< 0x00000004 */
#define CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL                      CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL_Msk               /*!<  */
#define CA35SSC_PLL_ENABLE_WC1_EN_PLL_OBS_Pos                    (31U)
#define CA35SSC_PLL_ENABLE_WC1_EN_PLL_OBS_Msk                    (0x1UL << CA35SSC_PLL_ENABLE_WC1_EN_PLL_OBS_Pos)       /*!< 0x80000000 */
#define CA35SSC_PLL_ENABLE_WC1_EN_PLL_OBS                        CA35SSC_PLL_ENABLE_WC1_EN_PLL_OBS_Msk                 /*!<  */

/************  Bit definition for CA35SSC_PLL_ENABLE_WT1 register  ************/
#define CA35SSC_PLL_ENABLE_WT1_PLL_EN_Pos                        (0U)
#define CA35SSC_PLL_ENABLE_WT1_PLL_EN_Msk                        (0x1UL << CA35SSC_PLL_ENABLE_WT1_PLL_EN_Pos)           /*!< 0x00000001 */
#define CA35SSC_PLL_ENABLE_WT1_PLL_EN                            CA35SSC_PLL_ENABLE_WT1_PLL_EN_Msk                     /*!<  */
#define CA35SSC_PLL_ENABLE_WT1_LOCKP_Pos                         (1U)
#define CA35SSC_PLL_ENABLE_WT1_LOCKP_Msk                         (0x1UL << CA35SSC_PLL_ENABLE_WT1_LOCKP_Pos)            /*!< 0x00000002 */
#define CA35SSC_PLL_ENABLE_WT1_LOCKP                             CA35SSC_PLL_ENABLE_WT1_LOCKP_Msk                      /*!<  */
#define CA35SSC_PLL_ENABLE_WT1_NRESET_SWPLL_Pos                  (2U)
#define CA35SSC_PLL_ENABLE_WT1_NRESET_SWPLL_Msk                  (0x1UL << CA35SSC_PLL_ENABLE_WT1_NRESET_SWPLL_Pos)     /*!< 0x00000004 */
#define CA35SSC_PLL_ENABLE_WT1_NRESET_SWPLL                      CA35SSC_PLL_ENABLE_WT1_NRESET_SWPLL_Msk               /*!<  */
#define CA35SSC_PLL_ENABLE_WT1_EN_PLL_OBS_Pos                    (31U)
#define CA35SSC_PLL_ENABLE_WT1_EN_PLL_OBS_Msk                    (0x1UL << CA35SSC_PLL_ENABLE_WT1_EN_PLL_OBS_Pos)       /*!< 0x80000000 */
#define CA35SSC_PLL_ENABLE_WT1_EN_PLL_OBS                        CA35SSC_PLL_ENABLE_WT1_EN_PLL_OBS_Msk                 /*!<  */

/*********  Bit definition for CA35SSC_LPI_TSGEN_NTS_CR_RW register  *********/
#define CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSREQ_Pos               (8U)
#define CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSREQ_Msk               (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSREQ_Pos)  /*!< 0x00000100 */
#define CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSREQ                   CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSREQ_Msk            /*!<  */
#define CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSACK_Pos               (9U)
#define CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSACK_Msk               (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSACK_Pos)  /*!< 0x00000200 */
#define CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSACK                   CA35SSC_LPI_TSGEN_NTS_CR_RW_TS_CSYSACK_Msk            /*!<  */

/*********  Bit definition for CA35SSC_LPI_TSGEN_NTS_CR_WS1 register  *********/
#define CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSREQ_Pos              (8U)
#define CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSREQ_Msk              (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSREQ_Pos) /*!< 0x00000100 */
#define CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSREQ                  CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSREQ_Msk           /*!<  */
#define CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSACK_Pos              (9U)
#define CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSACK_Msk              (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSACK_Pos) /*!< 0x00000200 */
#define CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSACK                  CA35SSC_LPI_TSGEN_NTS_CR_WS1_TS_CSYSACK_Msk           /*!<  */

/*********  Bit definition for CA35SSC_LPI_TSGEN_NTS_CR_WC1 register  *********/
#define CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSREQ_Pos              (8U)
#define CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSREQ_Msk              (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSREQ_Pos) /*!< 0x00000100 */
#define CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSREQ                  CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSREQ_Msk           /*!<  */
#define CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSACK_Pos              (9U)
#define CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSACK_Msk              (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSACK_Pos) /*!< 0x00000200 */
#define CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSACK                  CA35SSC_LPI_TSGEN_NTS_CR_WC1_TS_CSYSACK_Msk           /*!<  */

/*********  Bit definition for CA35SSC_LPI_TSGEN_NTS_CR_WT1 register  *********/
#define CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSREQ_Pos              (8U)
#define CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSREQ_Msk              (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSREQ_Pos) /*!< 0x00000100 */
#define CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSREQ                  CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSREQ_Msk           /*!<  */
#define CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSACK_Pos              (9U)
#define CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSACK_Msk              (0x1UL << CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSACK_Pos) /*!< 0x00000200 */
#define CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSACK                  CA35SSC_LPI_TSGEN_NTS_CR_WT1_TS_CSYSACK_Msk           /*!<  */

/*************  Bit definition for CA35SSC_CORE0_SMP register  *************/
#define CA35SSC_CORE0_SMP_SMPEN_Pos                              (16U)
#define CA35SSC_CORE0_SMP_SMPEN_Msk                              (0x1UL << CA35SSC_CORE0_SMP_SMPEN_Pos)                 /*!< 0x00010000 */
#define CA35SSC_CORE0_SMP_SMPEN                                  CA35SSC_CORE0_SMP_SMPEN_Msk                           /*!<  */

/*************  Bit definition for CA35SSC_CORE1_SMP register  *************/
#define CA35SSC_CORE1_SMP_SMPEN_Pos                              (16U)
#define CA35SSC_CORE1_SMP_SMPEN_Msk                              (0x1UL << CA35SSC_CORE1_SMP_SMPEN_Pos)                 /*!< 0x00010000 */
#define CA35SSC_CORE1_SMP_SMPEN                                  CA35SSC_CORE1_SMP_SMPEN_Msk                           /*!<  */

/*********  Bit definition for CA35SSC_LPI_STGEN_NTS_CR_RW register  *********/
#define CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSREQ_Pos            (24U)
#define CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSREQ_Msk            (0x1UL << CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSREQ_Pos) /*!< 0x01000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSREQ                CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSREQ_Msk           /*!<  */
#define CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSACK_Pos            (25U)
#define CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSACK_Msk            (0x1UL << CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSACK_Pos) /*!< 0x02000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSACK                CA35SSC_LPI_STGEN_NTS_CR_RW_STGEN_CSYSACK_Msk           /*!<  */

/*********  Bit definition for CA35SSC_LPI_STGEN_NTS_CR_WS1 register  *********/
#define CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSREQ_Pos           (24U)
#define CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSREQ_Msk           (0x1UL << CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSREQ_Pos) /*!< 0x01000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSREQ               CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSREQ_Msk           /*!<  */
#define CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSACK_Pos           (25U)
#define CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSACK_Msk           (0x1UL << CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSACK_Pos) /*!< 0x02000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSACK               CA35SSC_LPI_STGEN_NTS_CR_WS1_STGEN_CSYSACK_Msk           /*!<  */

/*********  Bit definition for CA35SSC_LPI_STGEN_NTS_CR_WC1 register  *********/
#define CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSREQ_Pos           (24U)
#define CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSREQ_Msk           (0x1UL << CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSREQ_Pos) /*!< 0x01000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSREQ               CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSREQ_Msk           /*!<  */
#define CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSACK_Pos           (25U)
#define CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSACK_Msk           (0x1UL << CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSACK_Pos) /*!< 0x02000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSACK               CA35SSC_LPI_STGEN_NTS_CR_WC1_STGEN_CSYSACK_Msk           /*!<  */

