STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215dxx_ca35.h
/* Bit fields for RCC_HSIFVALR register */
#define RCC_HSIFVALR_HSIVAL_Pos                    (0U)
#define RCC_HSIFVALR_HSIVAL_Msk                    (0x7FFUL << RCC_HSIFVALR_HSIVAL_Pos)                 /*!< 0x000007FF */
#define RCC_HSIFVALR_HSIVAL                        RCC_HSIFVALR_HSIVAL_Msk                           /*!< HSI clock-cycle counter value */

/* Bit fields for RCC_MSIFMONCR register */
#define RCC_MSIFMONCR_MSIREF_Pos                   (0U)
#define RCC_MSIFMONCR_MSIREF_Msk                   (0x1FFUL << RCC_MSIFMONCR_MSIREF_Pos)                /*!< 0x000001FF */
#define RCC_MSIFMONCR_MSIREF                       RCC_MSIFMONCR_MSIREF_Msk                          /*!< MSI clock count reference value */
#define RCC_MSIFMONCR_MSIMONEN_Pos                 (15U)
#define RCC_MSIFMONCR_MSIMONEN_Msk                 (0x1UL << RCC_MSIFMONCR_MSIMONEN_Pos)                /*!< 0x00008000 */
#define RCC_MSIFMONCR_MSIMONEN                     RCC_MSIFMONCR_MSIMONEN_Msk                        /*!< MSI clock period monitor enable */
#define RCC_MSIFMONCR_MSIDEV_Pos                   (16U)
#define RCC_MSIFMONCR_MSIDEV_Msk                   (0x1FUL << RCC_MSIFMONCR_MSIDEV_Pos)                 /*!< 0x001F0000 */
#define RCC_MSIFMONCR_MSIDEV                       RCC_MSIFMONCR_MSIDEV_Msk                          /*!< MSI clock count deviation value */
#define RCC_MSIFMONCR_MSIMONIE_Pos                 (30U)
#define RCC_MSIFMONCR_MSIMONIE_Msk                 (0x1UL << RCC_MSIFMONCR_MSIMONIE_Pos)                /*!< 0x40000000 */
#define RCC_MSIFMONCR_MSIMONIE                     RCC_MSIFMONCR_MSIMONIE_Msk                        /*!< MSI clock period monitor interrupt enable */
#define RCC_MSIFMONCR_MSIMONF_Pos                  (31U)
#define RCC_MSIFMONCR_MSIMONF_Msk                  (0x1UL << RCC_MSIFMONCR_MSIMONF_Pos)                 /*!< 0x80000000 */
#define RCC_MSIFMONCR_MSIMONF                      RCC_MSIFMONCR_MSIMONF_Msk                         /*!< MSI clock period monitor interrupt flag */

/* Bit fields for RCC_MSIFVALR register */
#define RCC_MSIFVALR_MSIVAL_Pos                    (0U)
#define RCC_MSIFVALR_MSIVAL_Msk                    (0x1FFUL << RCC_MSIFVALR_MSIVAL_Pos)                 /*!< 0x000001FF */
#define RCC_MSIFVALR_MSIVAL                        RCC_MSIFVALR_MSIVAL_Msk                           /*!< MSI clock-cycle counter value */

/* Bit fields for RCC_TIM1CFGR register */
#define RCC_TIM1CFGR_TIM1RST_Pos                   (0U)
#define RCC_TIM1CFGR_TIM1RST_Msk                   (0x1UL << RCC_TIM1CFGR_TIM1RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM1CFGR_TIM1RST                       RCC_TIM1CFGR_TIM1RST_Msk                          /*!< TIM1 reset */
#define RCC_TIM1CFGR_TIM1EN_Pos                    (1U)
#define RCC_TIM1CFGR_TIM1EN_Msk                    (0x1UL << RCC_TIM1CFGR_TIM1EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM1CFGR_TIM1EN                        RCC_TIM1CFGR_TIM1EN_Msk                           /*!< TIM1 clock enable */
#define RCC_TIM1CFGR_TIM1LPEN_Pos                  (2U)
#define RCC_TIM1CFGR_TIM1LPEN_Msk                  (0x1UL << RCC_TIM1CFGR_TIM1LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM1CFGR_TIM1LPEN                      RCC_TIM1CFGR_TIM1LPEN_Msk                         /*!< TIM1 clock enable during CSleep */

/* Bit fields for RCC_TIM2CFGR register */
#define RCC_TIM2CFGR_TIM2RST_Pos                   (0U)
#define RCC_TIM2CFGR_TIM2RST_Msk                   (0x1UL << RCC_TIM2CFGR_TIM2RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM2CFGR_TIM2RST                       RCC_TIM2CFGR_TIM2RST_Msk                          /*!< TIM2 reset */
#define RCC_TIM2CFGR_TIM2EN_Pos                    (1U)
#define RCC_TIM2CFGR_TIM2EN_Msk                    (0x1UL << RCC_TIM2CFGR_TIM2EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM2CFGR_TIM2EN                        RCC_TIM2CFGR_TIM2EN_Msk                           /*!< TIM2 clock enable */
#define RCC_TIM2CFGR_TIM2LPEN_Pos                  (2U)
#define RCC_TIM2CFGR_TIM2LPEN_Msk                  (0x1UL << RCC_TIM2CFGR_TIM2LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM2CFGR_TIM2LPEN                      RCC_TIM2CFGR_TIM2LPEN_Msk                         /*!< TIM2 clock enable during CSleep */

/* Bit fields for RCC_TIM3CFGR register */
#define RCC_TIM3CFGR_TIM3RST_Pos                   (0U)
#define RCC_TIM3CFGR_TIM3RST_Msk                   (0x1UL << RCC_TIM3CFGR_TIM3RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM3CFGR_TIM3RST                       RCC_TIM3CFGR_TIM3RST_Msk                          /*!< TIM3 reset */
#define RCC_TIM3CFGR_TIM3EN_Pos                    (1U)
#define RCC_TIM3CFGR_TIM3EN_Msk                    (0x1UL << RCC_TIM3CFGR_TIM3EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM3CFGR_TIM3EN                        RCC_TIM3CFGR_TIM3EN_Msk                           /*!< TIM3 clock enable */
#define RCC_TIM3CFGR_TIM3LPEN_Pos                  (2U)
#define RCC_TIM3CFGR_TIM3LPEN_Msk                  (0x1UL << RCC_TIM3CFGR_TIM3LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM3CFGR_TIM3LPEN                      RCC_TIM3CFGR_TIM3LPEN_Msk                         /*!< TIM3 clock enable during CSleep */

/* Bit fields for RCC_TIM4CFGR register */
#define RCC_TIM4CFGR_TIM4RST_Pos                   (0U)
#define RCC_TIM4CFGR_TIM4RST_Msk                   (0x1UL << RCC_TIM4CFGR_TIM4RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM4CFGR_TIM4RST                       RCC_TIM4CFGR_TIM4RST_Msk                          /*!< TIM4 reset */
#define RCC_TIM4CFGR_TIM4EN_Pos                    (1U)
#define RCC_TIM4CFGR_TIM4EN_Msk                    (0x1UL << RCC_TIM4CFGR_TIM4EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM4CFGR_TIM4EN                        RCC_TIM4CFGR_TIM4EN_Msk                           /*!< TIM4 clock enable */
#define RCC_TIM4CFGR_TIM4LPEN_Pos                  (2U)
#define RCC_TIM4CFGR_TIM4LPEN_Msk                  (0x1UL << RCC_TIM4CFGR_TIM4LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM4CFGR_TIM4LPEN                      RCC_TIM4CFGR_TIM4LPEN_Msk                         /*!< TIM4 clock enable during CSleep */

/* Bit fields for RCC_TIM5CFGR register */
#define RCC_TIM5CFGR_TIM5RST_Pos                   (0U)
#define RCC_TIM5CFGR_TIM5RST_Msk                   (0x1UL << RCC_TIM5CFGR_TIM5RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM5CFGR_TIM5RST                       RCC_TIM5CFGR_TIM5RST_Msk                          /*!< TIM5 reset */
#define RCC_TIM5CFGR_TIM5EN_Pos                    (1U)
#define RCC_TIM5CFGR_TIM5EN_Msk                    (0x1UL << RCC_TIM5CFGR_TIM5EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM5CFGR_TIM5EN                        RCC_TIM5CFGR_TIM5EN_Msk                           /*!< TIM5 clock enable */
#define RCC_TIM5CFGR_TIM5LPEN_Pos                  (2U)
#define RCC_TIM5CFGR_TIM5LPEN_Msk                  (0x1UL << RCC_TIM5CFGR_TIM5LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM5CFGR_TIM5LPEN                      RCC_TIM5CFGR_TIM5LPEN_Msk                         /*!< TIM5 clock enable during CSleep */

/* Bit fields for RCC_TIM6CFGR register */
#define RCC_TIM6CFGR_TIM6RST_Pos                   (0U)
#define RCC_TIM6CFGR_TIM6RST_Msk                   (0x1UL << RCC_TIM6CFGR_TIM6RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM6CFGR_TIM6RST                       RCC_TIM6CFGR_TIM6RST_Msk                          /*!< TIM6 reset */
#define RCC_TIM6CFGR_TIM6EN_Pos                    (1U)
#define RCC_TIM6CFGR_TIM6EN_Msk                    (0x1UL << RCC_TIM6CFGR_TIM6EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM6CFGR_TIM6EN                        RCC_TIM6CFGR_TIM6EN_Msk                           /*!< TIM6 clock enable */
#define RCC_TIM6CFGR_TIM6LPEN_Pos                  (2U)
#define RCC_TIM6CFGR_TIM6LPEN_Msk                  (0x1UL << RCC_TIM6CFGR_TIM6LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM6CFGR_TIM6LPEN                      RCC_TIM6CFGR_TIM6LPEN_Msk                         /*!< TIM6 clock enable during CSleep */

/* Bit fields for RCC_TIM7CFGR register */
#define RCC_TIM7CFGR_TIM7RST_Pos                   (0U)
#define RCC_TIM7CFGR_TIM7RST_Msk                   (0x1UL << RCC_TIM7CFGR_TIM7RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM7CFGR_TIM7RST                       RCC_TIM7CFGR_TIM7RST_Msk                          /*!< TIM7 reset */
#define RCC_TIM7CFGR_TIM7EN_Pos                    (1U)
#define RCC_TIM7CFGR_TIM7EN_Msk                    (0x1UL << RCC_TIM7CFGR_TIM7EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM7CFGR_TIM7EN                        RCC_TIM7CFGR_TIM7EN_Msk                           /*!< TIM7 clock enable */
#define RCC_TIM7CFGR_TIM7LPEN_Pos                  (2U)
#define RCC_TIM7CFGR_TIM7LPEN_Msk                  (0x1UL << RCC_TIM7CFGR_TIM7LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM7CFGR_TIM7LPEN                      RCC_TIM7CFGR_TIM7LPEN_Msk                         /*!< TIM7 clock enable during CSleep */

