STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215dxx_ca35.h
/******************  Bit definition for SERC_IER5 register  *******************/
#define SERC_IER5_PDRIE160_Pos        (0U)
#define SERC_IER5_PDRIE160_Msk        (0x1UL << SERC_IER5_PDRIE160_Pos)   /*!< 0x00000001 */
#define SERC_IER5_PDRIE160            SERC_IER5_PDRIE160_Msk
#define SERC_IER5_PDRIE161_Pos        (1U)
#define SERC_IER5_PDRIE161_Msk        (0x1UL << SERC_IER5_PDRIE161_Pos)   /*!< 0x00000002 */
#define SERC_IER5_PDRIE161            SERC_IER5_PDRIE161_Msk
#define SERC_IER5_PDRIE162_Pos        (2U)
#define SERC_IER5_PDRIE162_Msk        (0x1UL << SERC_IER5_PDRIE162_Pos)   /*!< 0x00000004 */
#define SERC_IER5_PDRIE162            SERC_IER5_PDRIE162_Msk
#define SERC_IER5_PDRIE163_Pos        (3U)
#define SERC_IER5_PDRIE163_Msk        (0x1UL << SERC_IER5_PDRIE163_Pos)   /*!< 0x00000008 */
#define SERC_IER5_PDRIE163            SERC_IER5_PDRIE163_Msk
#define SERC_IER5_PDRIE164_Pos        (4U)
#define SERC_IER5_PDRIE164_Msk        (0x1UL << SERC_IER5_PDRIE164_Pos)   /*!< 0x00000010 */
#define SERC_IER5_PDRIE164            SERC_IER5_PDRIE164_Msk
#define SERC_IER5_PDRIE165_Pos        (5U)
#define SERC_IER5_PDRIE165_Msk        (0x1UL << SERC_IER5_PDRIE165_Pos)   /*!< 0x00000020 */
#define SERC_IER5_PDRIE165            SERC_IER5_PDRIE165_Msk
#define SERC_IER5_PDRIE166_Pos        (6U)
#define SERC_IER5_PDRIE166_Msk        (0x1UL << SERC_IER5_PDRIE166_Pos)   /*!< 0x00000040 */
#define SERC_IER5_PDRIE166            SERC_IER5_PDRIE166_Msk
#define SERC_IER5_PDRIE167_Pos        (7U)
#define SERC_IER5_PDRIE167_Msk        (0x1UL << SERC_IER5_PDRIE167_Pos)   /*!< 0x00000080 */
#define SERC_IER5_PDRIE167            SERC_IER5_PDRIE167_Msk
#define SERC_IER5_PDRIE168_Pos        (8U)
#define SERC_IER5_PDRIE168_Msk        (0x1UL << SERC_IER5_PDRIE168_Pos)   /*!< 0x00000100 */
#define SERC_IER5_PDRIE168            SERC_IER5_PDRIE168_Msk
#define SERC_IER5_PDRIE169_Pos        (9U)
#define SERC_IER5_PDRIE169_Msk        (0x1UL << SERC_IER5_PDRIE169_Pos)   /*!< 0x00000200 */
#define SERC_IER5_PDRIE169            SERC_IER5_PDRIE169_Msk
#define SERC_IER5_PDRIE170_Pos        (10U)
#define SERC_IER5_PDRIE170_Msk        (0x1UL << SERC_IER5_PDRIE170_Pos)   /*!< 0x00000400 */
#define SERC_IER5_PDRIE170            SERC_IER5_PDRIE170_Msk
#define SERC_IER5_PDRIE171_Pos        (11U)
#define SERC_IER5_PDRIE171_Msk        (0x1UL << SERC_IER5_PDRIE171_Pos)   /*!< 0x00000800 */
#define SERC_IER5_PDRIE171            SERC_IER5_PDRIE171_Msk
#define SERC_IER5_PDRIE172_Pos        (12U)
#define SERC_IER5_PDRIE172_Msk        (0x1UL << SERC_IER5_PDRIE172_Pos)   /*!< 0x00001000 */
#define SERC_IER5_PDRIE172            SERC_IER5_PDRIE172_Msk
#define SERC_IER5_PDRIE173_Pos        (13U)
#define SERC_IER5_PDRIE173_Msk        (0x1UL << SERC_IER5_PDRIE173_Pos)   /*!< 0x00002000 */
#define SERC_IER5_PDRIE173            SERC_IER5_PDRIE173_Msk
#define SERC_IER5_PDRIE174_Pos        (14U)
#define SERC_IER5_PDRIE174_Msk        (0x1UL << SERC_IER5_PDRIE174_Pos)   /*!< 0x00004000 */
#define SERC_IER5_PDRIE174            SERC_IER5_PDRIE174_Msk
#define SERC_IER5_PDRIE175_Pos        (15U)
#define SERC_IER5_PDRIE175_Msk        (0x1UL << SERC_IER5_PDRIE175_Pos)   /*!< 0x00008000 */
#define SERC_IER5_PDRIE175            SERC_IER5_PDRIE175_Msk
#define SERC_IER5_PDRIE176_Pos        (16U)
#define SERC_IER5_PDRIE176_Msk        (0x1UL << SERC_IER5_PDRIE176_Pos)   /*!< 0x00010000 */
#define SERC_IER5_PDRIE176            SERC_IER5_PDRIE176_Msk
#define SERC_IER5_PDRIE177_Pos        (17U)
#define SERC_IER5_PDRIE177_Msk        (0x1UL << SERC_IER5_PDRIE177_Pos)   /*!< 0x00020000 */
#define SERC_IER5_PDRIE177            SERC_IER5_PDRIE177_Msk
#define SERC_IER5_PDRIE178_Pos        (18U)
#define SERC_IER5_PDRIE178_Msk        (0x1UL << SERC_IER5_PDRIE178_Pos)   /*!< 0x00040000 */
#define SERC_IER5_PDRIE178            SERC_IER5_PDRIE178_Msk
#define SERC_IER5_PDRIE179_Pos        (19U)
#define SERC_IER5_PDRIE179_Msk        (0x1UL << SERC_IER5_PDRIE179_Pos)   /*!< 0x00080000 */
#define SERC_IER5_PDRIE179            SERC_IER5_PDRIE179_Msk
#define SERC_IER5_PDRIE180_Pos        (20U)
#define SERC_IER5_PDRIE180_Msk        (0x1UL << SERC_IER5_PDRIE180_Pos)   /*!< 0x00100000 */
#define SERC_IER5_PDRIE180            SERC_IER5_PDRIE180_Msk
#define SERC_IER5_PDRIE181_Pos        (21U)
#define SERC_IER5_PDRIE181_Msk        (0x1UL << SERC_IER5_PDRIE181_Pos)   /*!< 0x00200000 */
#define SERC_IER5_PDRIE181            SERC_IER5_PDRIE181_Msk
#define SERC_IER5_PDRIE182_Pos        (22U)
#define SERC_IER5_PDRIE182_Msk        (0x1UL << SERC_IER5_PDRIE182_Pos)   /*!< 0x00400000 */
#define SERC_IER5_PDRIE182            SERC_IER5_PDRIE182_Msk
#define SERC_IER5_PDRIE183_Pos        (23U)
#define SERC_IER5_PDRIE183_Msk        (0x1UL << SERC_IER5_PDRIE183_Pos)   /*!< 0x00800000 */
#define SERC_IER5_PDRIE183            SERC_IER5_PDRIE183_Msk
#define SERC_IER5_PDRIE184_Pos        (24U)
#define SERC_IER5_PDRIE184_Msk        (0x1UL << SERC_IER5_PDRIE184_Pos)   /*!< 0x01000000 */
#define SERC_IER5_PDRIE184            SERC_IER5_PDRIE184_Msk
#define SERC_IER5_PDRIE185_Pos        (25U)
#define SERC_IER5_PDRIE185_Msk        (0x1UL << SERC_IER5_PDRIE185_Pos)   /*!< 0x02000000 */
#define SERC_IER5_PDRIE185            SERC_IER5_PDRIE185_Msk
#define SERC_IER5_PDRIE186_Pos        (26U)
#define SERC_IER5_PDRIE186_Msk        (0x1UL << SERC_IER5_PDRIE186_Pos)   /*!< 0x04000000 */
#define SERC_IER5_PDRIE186            SERC_IER5_PDRIE186_Msk
#define SERC_IER5_PDRIE187_Pos        (27U)
#define SERC_IER5_PDRIE187_Msk        (0x1UL << SERC_IER5_PDRIE187_Pos)   /*!< 0x08000000 */
#define SERC_IER5_PDRIE187            SERC_IER5_PDRIE187_Msk
#define SERC_IER5_PDRIE188_Pos        (28U)
#define SERC_IER5_PDRIE188_Msk        (0x1UL << SERC_IER5_PDRIE188_Pos)   /*!< 0x10000000 */
#define SERC_IER5_PDRIE188            SERC_IER5_PDRIE188_Msk
#define SERC_IER5_PDRIE189_Pos        (29U)
#define SERC_IER5_PDRIE189_Msk        (0x1UL << SERC_IER5_PDRIE189_Pos)   /*!< 0x20000000 */
#define SERC_IER5_PDRIE189            SERC_IER5_PDRIE189_Msk
#define SERC_IER5_PDRIE190_Pos        (30U)
#define SERC_IER5_PDRIE190_Msk        (0x1UL << SERC_IER5_PDRIE190_Pos)   /*!< 0x40000000 */
#define SERC_IER5_PDRIE190            SERC_IER5_PDRIE190_Msk
#define SERC_IER5_PDRIE191_Pos        (31U)
#define SERC_IER5_PDRIE191_Msk        (0x1UL << SERC_IER5_PDRIE191_Pos)   /*!< 0x80000000 */
#define SERC_IER5_PDRIE191            SERC_IER5_PDRIE191_Msk

/******************  Bit definition for SERC_ISR0 register  *******************/
#define SERC_ISR0_PDRS0_Pos          (0U)
#define SERC_ISR0_PDRS0_Msk          (0x1UL << SERC_ISR0_PDRS0_Pos)     /*!< 0x00000001 */
#define SERC_ISR0_PDRS0              SERC_ISR0_PDRS0_Msk
#define SERC_ISR0_PDRS1_Pos          (1U)
#define SERC_ISR0_PDRS1_Msk          (0x1UL << SERC_ISR0_PDRS1_Pos)     /*!< 0x00000002 */
#define SERC_ISR0_PDRS1              SERC_ISR0_PDRS1_Msk
#define SERC_ISR0_PDRS2_Pos          (2U)
#define SERC_ISR0_PDRS2_Msk          (0x1UL << SERC_ISR0_PDRS2_Pos)     /*!< 0x00000004 */
#define SERC_ISR0_PDRS2              SERC_ISR0_PDRS2_Msk
#define SERC_ISR0_PDRS3_Pos          (3U)
#define SERC_ISR0_PDRS3_Msk          (0x1UL << SERC_ISR0_PDRS3_Pos)     /*!< 0x00000008 */
#define SERC_ISR0_PDRS3              SERC_ISR0_PDRS3_Msk
#define SERC_ISR0_PDRS4_Pos          (4U)
#define SERC_ISR0_PDRS4_Msk          (0x1UL << SERC_ISR0_PDRS4_Pos)     /*!< 0x00000010 */
#define SERC_ISR0_PDRS4              SERC_ISR0_PDRS4_Msk
#define SERC_ISR0_PDRS5_Pos          (5U)
#define SERC_ISR0_PDRS5_Msk          (0x1UL << SERC_ISR0_PDRS5_Pos)     /*!< 0x00000020 */
#define SERC_ISR0_PDRS5              SERC_ISR0_PDRS5_Msk
#define SERC_ISR0_PDRS6_Pos          (6U)
#define SERC_ISR0_PDRS6_Msk          (0x1UL << SERC_ISR0_PDRS6_Pos)     /*!< 0x00000040 */
#define SERC_ISR0_PDRS6              SERC_ISR0_PDRS6_Msk
#define SERC_ISR0_PDRS7_Pos          (7U)
#define SERC_ISR0_PDRS7_Msk          (0x1UL << SERC_ISR0_PDRS7_Pos)     /*!< 0x00000080 */
#define SERC_ISR0_PDRS7              SERC_ISR0_PDRS7_Msk
#define SERC_ISR0_PDRS8_Pos          (8U)
#define SERC_ISR0_PDRS8_Msk          (0x1UL << SERC_ISR0_PDRS8_Pos)     /*!< 0x00000100 */
#define SERC_ISR0_PDRS8              SERC_ISR0_PDRS8_Msk
#define SERC_ISR0_PDRS9_Pos          (9U)
#define SERC_ISR0_PDRS9_Msk          (0x1UL << SERC_ISR0_PDRS9_Pos)     /*!< 0x00000200 */
#define SERC_ISR0_PDRS9              SERC_ISR0_PDRS9_Msk
#define SERC_ISR0_PDRS10_Pos         (10U)
#define SERC_ISR0_PDRS10_Msk         (0x1UL << SERC_ISR0_PDRS10_Pos)    /*!< 0x00000400 */
#define SERC_ISR0_PDRS10             SERC_ISR0_PDRS10_Msk
#define SERC_ISR0_PDRS11_Pos         (11U)
#define SERC_ISR0_PDRS11_Msk         (0x1UL << SERC_ISR0_PDRS11_Pos)    /*!< 0x00000800 */
#define SERC_ISR0_PDRS11             SERC_ISR0_PDRS11_Msk
#define SERC_ISR0_PDRS12_Pos         (12U)
#define SERC_ISR0_PDRS12_Msk         (0x1UL << SERC_ISR0_PDRS12_Pos)    /*!< 0x00001000 */
#define SERC_ISR0_PDRS12             SERC_ISR0_PDRS12_Msk
#define SERC_ISR0_PDRS13_Pos         (13U)
#define SERC_ISR0_PDRS13_Msk         (0x1UL << SERC_ISR0_PDRS13_Pos)    /*!< 0x00002000 */
#define SERC_ISR0_PDRS13             SERC_ISR0_PDRS13_Msk
#define SERC_ISR0_PDRS14_Pos         (14U)
#define SERC_ISR0_PDRS14_Msk         (0x1UL << SERC_ISR0_PDRS14_Pos)    /*!< 0x00004000 */
#define SERC_ISR0_PDRS14             SERC_ISR0_PDRS14_Msk
#define SERC_ISR0_PDRS15_Pos         (15U)
#define SERC_ISR0_PDRS15_Msk         (0x1UL << SERC_ISR0_PDRS15_Pos)    /*!< 0x00008000 */
#define SERC_ISR0_PDRS15             SERC_ISR0_PDRS15_Msk
#define SERC_ISR0_PDRS16_Pos         (16U)
#define SERC_ISR0_PDRS16_Msk         (0x1UL << SERC_ISR0_PDRS16_Pos)    /*!< 0x00010000 */
#define SERC_ISR0_PDRS16             SERC_ISR0_PDRS16_Msk
#define SERC_ISR0_PDRS17_Pos         (17U)
#define SERC_ISR0_PDRS17_Msk         (0x1UL << SERC_ISR0_PDRS17_Pos)    /*!< 0x00020000 */
#define SERC_ISR0_PDRS17             SERC_ISR0_PDRS17_Msk
#define SERC_ISR0_PDRS18_Pos         (18U)
#define SERC_ISR0_PDRS18_Msk         (0x1UL << SERC_ISR0_PDRS18_Pos)    /*!< 0x00040000 */
#define SERC_ISR0_PDRS18             SERC_ISR0_PDRS18_Msk
#define SERC_ISR0_PDRS19_Pos         (19U)
#define SERC_ISR0_PDRS19_Msk         (0x1UL << SERC_ISR0_PDRS19_Pos)    /*!< 0x00080000 */
#define SERC_ISR0_PDRS19             SERC_ISR0_PDRS19_Msk
#define SERC_ISR0_PDRS20_Pos         (20U)
#define SERC_ISR0_PDRS20_Msk         (0x1UL << SERC_ISR0_PDRS20_Pos)    /*!< 0x00100000 */
#define SERC_ISR0_PDRS20             SERC_ISR0_PDRS20_Msk
#define SERC_ISR0_PDRS21_Pos         (21U)
#define SERC_ISR0_PDRS21_Msk         (0x1UL << SERC_ISR0_PDRS21_Pos)    /*!< 0x00200000 */
#define SERC_ISR0_PDRS21             SERC_ISR0_PDRS21_Msk
#define SERC_ISR0_PDRS22_Pos         (22U)
#define SERC_ISR0_PDRS22_Msk         (0x1UL << SERC_ISR0_PDRS22_Pos)    /*!< 0x00400000 */
#define SERC_ISR0_PDRS22             SERC_ISR0_PDRS22_Msk
#define SERC_ISR0_PDRS23_Pos         (23U)
#define SERC_ISR0_PDRS23_Msk         (0x1UL << SERC_ISR0_PDRS23_Pos)    /*!< 0x00800000 */
#define SERC_ISR0_PDRS23             SERC_ISR0_PDRS23_Msk
#define SERC_ISR0_PDRS24_Pos         (24U)
#define SERC_ISR0_PDRS24_Msk         (0x1UL << SERC_ISR0_PDRS24_Pos)    /*!< 0x01000000 */
#define SERC_ISR0_PDRS24             SERC_ISR0_PDRS24_Msk
#define SERC_ISR0_PDRS25_Pos         (25U)
#define SERC_ISR0_PDRS25_Msk         (0x1UL << SERC_ISR0_PDRS25_Pos)    /*!< 0x02000000 */
#define SERC_ISR0_PDRS25             SERC_ISR0_PDRS25_Msk
#define SERC_ISR0_PDRS26_Pos         (26U)
#define SERC_ISR0_PDRS26_Msk         (0x1UL << SERC_ISR0_PDRS26_Pos)    /*!< 0x04000000 */
#define SERC_ISR0_PDRS26             SERC_ISR0_PDRS26_Msk
#define SERC_ISR0_PDRS27_Pos         (27U)
#define SERC_ISR0_PDRS27_Msk         (0x1UL << SERC_ISR0_PDRS27_Pos)    /*!< 0x08000000 */
#define SERC_ISR0_PDRS27             SERC_ISR0_PDRS27_Msk
#define SERC_ISR0_PDRS28_Pos         (28U)
#define SERC_ISR0_PDRS28_Msk         (0x1UL << SERC_ISR0_PDRS28_Pos)    /*!< 0x10000000 */
#define SERC_ISR0_PDRS28             SERC_ISR0_PDRS28_Msk
#define SERC_ISR0_PDRS29_Pos         (29U)
#define SERC_ISR0_PDRS29_Msk         (0x1UL << SERC_ISR0_PDRS29_Pos)    /*!< 0x20000000 */
#define SERC_ISR0_PDRS29             SERC_ISR0_PDRS29_Msk
#define SERC_ISR0_PDRS30_Pos         (30U)
#define SERC_ISR0_PDRS30_Msk         (0x1UL << SERC_ISR0_PDRS30_Pos)    /*!< 0x40000000 */
#define SERC_ISR0_PDRS30             SERC_ISR0_PDRS30_Msk
#define SERC_ISR0_PDRS31_Pos         (31U)
#define SERC_ISR0_PDRS31_Msk         (0x1UL << SERC_ISR0_PDRS31_Pos)    /*!< 0x80000000 */
#define SERC_ISR0_PDRS31             SERC_ISR0_PDRS31_Msk

/******************  Bit definition for SERC_ISR1 register  *******************/
#define SERC_ISR1_PDRS32_Pos         (0U)
#define SERC_ISR1_PDRS32_Msk         (0x1UL << SERC_ISR1_PDRS32_Pos)    /*!< 0x00000001 */
#define SERC_ISR1_PDRS32             SERC_ISR1_PDRS32_Msk
#define SERC_ISR1_PDRS33_Pos         (1U)
#define SERC_ISR1_PDRS33_Msk         (0x1UL << SERC_ISR1_PDRS33_Pos)    /*!< 0x00000002 */
#define SERC_ISR1_PDRS33             SERC_ISR1_PDRS33_Msk
#define SERC_ISR1_PDRS34_Pos         (2U)
#define SERC_ISR1_PDRS34_Msk         (0x1UL << SERC_ISR1_PDRS34_Pos)    /*!< 0x00000004 */
#define SERC_ISR1_PDRS34             SERC_ISR1_PDRS34_Msk
#define SERC_ISR1_PDRS35_Pos         (3U)
#define SERC_ISR1_PDRS35_Msk         (0x1UL << SERC_ISR1_PDRS35_Pos)    /*!< 0x00000008 */
#define SERC_ISR1_PDRS35             SERC_ISR1_PDRS35_Msk
#define SERC_ISR1_PDRS36_Pos         (4U)
#define SERC_ISR1_PDRS36_Msk         (0x1UL << SERC_ISR1_PDRS36_Pos)    /*!< 0x00000010 */
#define SERC_ISR1_PDRS36             SERC_ISR1_PDRS36_Msk
#define SERC_ISR1_PDRS37_Pos         (5U)
#define SERC_ISR1_PDRS37_Msk         (0x1UL << SERC_ISR1_PDRS37_Pos)    /*!< 0x00000020 */
#define SERC_ISR1_PDRS37             SERC_ISR1_PDRS37_Msk
#define SERC_ISR1_PDRS38_Pos         (6U)
#define SERC_ISR1_PDRS38_Msk         (0x1UL << SERC_ISR1_PDRS38_Pos)    /*!< 0x00000040 */
#define SERC_ISR1_PDRS38             SERC_ISR1_PDRS38_Msk
#define SERC_ISR1_PDRS39_Pos         (7U)
#define SERC_ISR1_PDRS39_Msk         (0x1UL << SERC_ISR1_PDRS39_Pos)    /*!< 0x00000080 */
#define SERC_ISR1_PDRS39             SERC_ISR1_PDRS39_Msk
#define SERC_ISR1_PDRS40_Pos         (8U)
#define SERC_ISR1_PDRS40_Msk         (0x1UL << SERC_ISR1_PDRS40_Pos)    /*!< 0x00000100 */
#define SERC_ISR1_PDRS40             SERC_ISR1_PDRS40_Msk
#define SERC_ISR1_PDRS41_Pos         (9U)
#define SERC_ISR1_PDRS41_Msk         (0x1UL << SERC_ISR1_PDRS41_Pos)    /*!< 0x00000200 */
#define SERC_ISR1_PDRS41             SERC_ISR1_PDRS41_Msk
#define SERC_ISR1_PDRS42_Pos         (10U)
#define SERC_ISR1_PDRS42_Msk         (0x1UL << SERC_ISR1_PDRS42_Pos)    /*!< 0x00000400 */
#define SERC_ISR1_PDRS42             SERC_ISR1_PDRS42_Msk
#define SERC_ISR1_PDRS43_Pos         (11U)
#define SERC_ISR1_PDRS43_Msk         (0x1UL << SERC_ISR1_PDRS43_Pos)    /*!< 0x00000800 */
#define SERC_ISR1_PDRS43             SERC_ISR1_PDRS43_Msk
#define SERC_ISR1_PDRS44_Pos         (12U)
#define SERC_ISR1_PDRS44_Msk         (0x1UL << SERC_ISR1_PDRS44_Pos)    /*!< 0x00001000 */
#define SERC_ISR1_PDRS44             SERC_ISR1_PDRS44_Msk
#define SERC_ISR1_PDRS45_Pos         (13U)
#define SERC_ISR1_PDRS45_Msk         (0x1UL << SERC_ISR1_PDRS45_Pos)    /*!< 0x00002000 */
#define SERC_ISR1_PDRS45             SERC_ISR1_PDRS45_Msk
#define SERC_ISR1_PDRS46_Pos         (14U)
#define SERC_ISR1_PDRS46_Msk         (0x1UL << SERC_ISR1_PDRS46_Pos)    /*!< 0x00004000 */
#define SERC_ISR1_PDRS46             SERC_ISR1_PDRS46_Msk
#define SERC_ISR1_PDRS47_Pos         (15U)
#define SERC_ISR1_PDRS47_Msk         (0x1UL << SERC_ISR1_PDRS47_Pos)    /*!< 0x00008000 */
#define SERC_ISR1_PDRS47             SERC_ISR1_PDRS47_Msk
#define SERC_ISR1_PDRS48_Pos         (16U)
#define SERC_ISR1_PDRS48_Msk         (0x1UL << SERC_ISR1_PDRS48_Pos)    /*!< 0x00010000 */
#define SERC_ISR1_PDRS48             SERC_ISR1_PDRS48_Msk
#define SERC_ISR1_PDRS49_Pos         (17U)
#define SERC_ISR1_PDRS49_Msk         (0x1UL << SERC_ISR1_PDRS49_Pos)    /*!< 0x00020000 */
#define SERC_ISR1_PDRS49             SERC_ISR1_PDRS49_Msk
#define SERC_ISR1_PDRS50_Pos         (18U)
#define SERC_ISR1_PDRS50_Msk         (0x1UL << SERC_ISR1_PDRS50_Pos)    /*!< 0x00040000 */
#define SERC_ISR1_PDRS50             SERC_ISR1_PDRS50_Msk
#define SERC_ISR1_PDRS51_Pos         (19U)
#define SERC_ISR1_PDRS51_Msk         (0x1UL << SERC_ISR1_PDRS51_Pos)    /*!< 0x00080000 */
#define SERC_ISR1_PDRS51             SERC_ISR1_PDRS51_Msk
#define SERC_ISR1_PDRS52_Pos         (20U)
#define SERC_ISR1_PDRS52_Msk         (0x1UL << SERC_ISR1_PDRS52_Pos)    /*!< 0x00100000 */
#define SERC_ISR1_PDRS52             SERC_ISR1_PDRS52_Msk
#define SERC_ISR1_PDRS53_Pos         (21U)
#define SERC_ISR1_PDRS53_Msk         (0x1UL << SERC_ISR1_PDRS53_Pos)    /*!< 0x00200000 */
#define SERC_ISR1_PDRS53             SERC_ISR1_PDRS53_Msk
#define SERC_ISR1_PDRS54_Pos         (22U)
#define SERC_ISR1_PDRS54_Msk         (0x1UL << SERC_ISR1_PDRS54_Pos)    /*!< 0x00400000 */
#define SERC_ISR1_PDRS54             SERC_ISR1_PDRS54_Msk
#define SERC_ISR1_PDRS55_Pos         (23U)
#define SERC_ISR1_PDRS55_Msk         (0x1UL << SERC_ISR1_PDRS55_Pos)    /*!< 0x00800000 */
#define SERC_ISR1_PDRS55             SERC_ISR1_PDRS55_Msk
#define SERC_ISR1_PDRS56_Pos         (24U)
#define SERC_ISR1_PDRS56_Msk         (0x1UL << SERC_ISR1_PDRS56_Pos)    /*!< 0x01000000 */
#define SERC_ISR1_PDRS56             SERC_ISR1_PDRS56_Msk
#define SERC_ISR1_PDRS57_Pos         (25U)
#define SERC_ISR1_PDRS57_Msk         (0x1UL << SERC_ISR1_PDRS57_Pos)    /*!< 0x02000000 */
#define SERC_ISR1_PDRS57             SERC_ISR1_PDRS57_Msk
#define SERC_ISR1_PDRS58_Pos         (26U)
#define SERC_ISR1_PDRS58_Msk         (0x1UL << SERC_ISR1_PDRS58_Pos)    /*!< 0x04000000 */
#define SERC_ISR1_PDRS58             SERC_ISR1_PDRS58_Msk
#define SERC_ISR1_PDRS59_Pos         (27U)
#define SERC_ISR1_PDRS59_Msk         (0x1UL << SERC_ISR1_PDRS59_Pos)    /*!< 0x08000000 */
#define SERC_ISR1_PDRS59             SERC_ISR1_PDRS59_Msk
#define SERC_ISR1_PDRS60_Pos         (28U)
#define SERC_ISR1_PDRS60_Msk         (0x1UL << SERC_ISR1_PDRS60_Pos)    /*!< 0x10000000 */
#define SERC_ISR1_PDRS60             SERC_ISR1_PDRS60_Msk
#define SERC_ISR1_PDRS61_Pos         (29U)
#define SERC_ISR1_PDRS61_Msk         (0x1UL << SERC_ISR1_PDRS61_Pos)    /*!< 0x20000000 */
#define SERC_ISR1_PDRS61             SERC_ISR1_PDRS61_Msk
#define SERC_ISR1_PDRS62_Pos         (30U)
#define SERC_ISR1_PDRS62_Msk         (0x1UL << SERC_ISR1_PDRS62_Pos)    /*!< 0x40000000 */
#define SERC_ISR1_PDRS62             SERC_ISR1_PDRS62_Msk
#define SERC_ISR1_PDRS63_Pos         (31U)
#define SERC_ISR1_PDRS63_Msk         (0x1UL << SERC_ISR1_PDRS63_Pos)    /*!< 0x80000000 */
#define SERC_ISR1_PDRS63             SERC_ISR1_PDRS63_Msk

